---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarBendingDetailType
source: html/1843adb5-5521-260b-c4ac-672da0452907.htm
---
# RebarBendingDetailType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.